gratico/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-10 Thu 19:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>grati.co</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Abhishiv Saxena" />
<link rel="stylesheet" type="text/css" href="../org/theme/styles.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">grati.co</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge9cda7f">Introduction</a>
<ul>
<li><a href="#org7e25538">Features</a></li>
<li><a href="#orga228de2">Example Document Format</a></li>
</ul>
</li>
<li><a href="#org5cbbb26">Language Bridge</a>
<ul>
<li><a href="#orgc414de8">Syntax</a></li>
<li><a href="#orgf7b8c07">Implication</a></li>
</ul>
</li>
<li><a href="#orga30fe14">UI Editor</a>
<ul>
<li><a href="#orgdae0d38">Architecture</a>
<ul>
<li><a href="#org65b9375">Root&lt;RootProps&gt;</a></li>
<li><a href="#org24c7b36">Typeschecker Intergation</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge9cda7f" class="outline-2">
<h2 id="orge9cda7f">Introduction</h2>
<div class="outline-text-2" id="text-orge9cda7f">
</div>
<div id="outline-container-org7e25538" class="outline-3">
<h3 id="org7e25538">Features</h3>
<div class="outline-text-3" id="text-org7e25538">
<ul class="org-ul">
<li>Polymorphic Document Format<br /></li>
<li>Extensible IDE<br /></li>
<li>Extensible REPL/Runtime<br /></li>
<li>Support for legacy code<br /></li>
<li>Tags<br /></li>
<li>Preview<br /></li>
<li>Tests<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orga228de2" class="outline-3">
<h3 id="orga228de2">Example Document Format</h3>
<div class="outline-text-3" id="text-orga228de2">
<ul class="org-ul">
<li>Code/Typescript using Language Bridge<br /></li>
<li>Table<br /></li>
<li>MDX<br /></li>
<li>Test Files<br /></li>
<li>Storybook<br /></li>
<li>GraphQL<br /></li>
<li>CSS Styles<br /></li>
<li>SVG Editor<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5cbbb26" class="outline-2">
<h2 id="org5cbbb26">Language Bridge</h2>
<div class="outline-text-2" id="text-org5cbbb26">
<p>
Simple typed language AST format to interface over multiple GPL Languages like typescript/python etc.<br />
</p>
</div>
<div id="outline-container-orgc414de8" class="outline-3">
<h3 id="orgc414de8">Syntax</h3>
<div class="outline-text-3" id="text-orgc414de8">
<ul class="org-ul">
<li>BasicLiterals(String/Number/Boolean/Null/Undefined/Void)<br /></li>
<li>Object<br /></li>
<li>Arrays<br /></li>
<li>Identifiers<br /></li>
<li>VariableAssignment<br /></li>
<li>Function<br /></li>
<li>FunctionApplication<br /></li>
<li>JSXElement<br /></li>
<li>JSXExpression<br /></li>
<li>TypeDeclaration<br /></li>
<li>InterfaceDeclaration<br /></li>
<li>Types<br />
<ul class="org-ul">
<li>LiteralTypes("john")<br /></li>
<li>BasicTypes(string | number | boolean | null | undefined | any | unknown)<br /></li>
<li>TypeApplication(to describe Functions/List/Tuple/Object)<br /></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf7b8c07" class="outline-3">
<h3 id="orgf7b8c07">Implication</h3>
<div class="outline-text-3" id="text-orgf7b8c07">
<p>
Due to simple structure of AST<br />
</p>
<ul class="org-ul">
<li>we can transpile to multiple languages<br /></li>
<li>Easily create JSONSchema for types generated<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga30fe14" class="outline-2">
<h2 id="orga30fe14">UI Editor</h2>
<div class="outline-text-2" id="text-orga30fe14">
</div>
<div id="outline-container-orgdae0d38" class="outline-3">
<h3 id="orgdae0d38">Architecture</h3>
<div class="outline-text-3" id="text-orgdae0d38">
</div>
<div id="outline-container-org65b9375" class="outline-4">
<h4 id="org65b9375">Root&lt;RootProps&gt;</h4>
<div class="outline-text-4" id="text-org65b9375">
</div>
<ul class="org-ul">
<li><a id="org8b8762d"></a>ComponentList<br />
<div class="outline-text-5" id="text-org8b8762d">
<p>
Loops through document and display all React Components in scope and the html ones.<br />
</p>
</div>
</li>
<li><a id="orgb467842"></a>Canvas<br />
<div class="outline-text-5" id="text-orgb467842">
<p>
Compiles AST into TS and loads it into runtime to render it.<br />
</p>
</div>
</li>
<li><a id="org7209750"></a>PropEditor<br />
<div class="outline-text-5" id="text-org7209750">
<p>
Shows props and allows to edit their value for selectedBlock.<br />
</p>
</div>
</li>
<li><a id="orga5eba23"></a>StyleEditor<br />
<div class="outline-text-5" id="text-orga5eba23">
<p>
If selected prop is style.<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org98af170"></a>Layout/Display<br /></li>
<li><a id="orgd810707"></a>Spacing<br /></li>
<li><a id="orgaffeaf3"></a>Size<br /></li>
<li><a id="org13fc5bc"></a>Position<br /></li>
<li><a id="org6ded544"></a>Background<br /></li>
<li><a id="org84307b1"></a>Border<br /></li>
<li><a id="org5669935"></a>Typography<br /></li>
<li><a id="orgfd173c8"></a>Effects<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org24c7b36" class="outline-4">
<h4 id="org24c7b36">Typeschecker Intergation</h4>
<div class="outline-text-4" id="text-org24c7b36">
<p>
Required methods<br />
</p>
<ul class="org-ul">
<li>getFunctionType<br /></li>
<li>getType<br /></li>
<li></li>
</ul>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #fb4933;">import</span> ts <span style="color: #fb4933;">from</span> <span style="color: #b8bb26;">'typescript'</span>
<span style="color: #fb4933;">import</span> <span style="color: #458588;">{</span>IKernel<span style="color: #458588;">}</span> <span style="color: #fb4933;">from</span> <span style="color: #b8bb26;">'./kernel'</span>
<span style="color: #fb4933;">import</span> <span style="color: #458588;">{</span>INode<span style="color: #458588;">}</span> <span style="color: #fb4933;">from</span> <span style="color: #b8bb26;">'../langauge/language'</span>
<span style="color: #fb4933;">export</span> <span style="color: #fb4933;">interface</span> <span style="color: #d3869b;">RootProps</span> <span style="color: #458588;">{</span>
    kernel: <span style="color: #d3869b;">IKernel</span>
    document: <span style="color: #d3869b;">INode</span>,
    path: <span style="color: #fb4933;">any</span><span style="color: #b16286;">[]</span>;
    selectedBlock: <span style="color: #fb4933;">any</span><span style="color: #b16286;">[]</span>;
    typechecker: ts.typechecker
<span style="color: #458588;">}</span>

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishiv Saxena</p>
<p class="date">Created: 2020-09-10 Thu 19:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
